app/controllers/api/v1/auth_controller.rb

    def create # auth#login
    #
    #     # @user = User.find_by(username: user_login_params[:username])
    #
        @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "p.nicholsen"], ["LIMIT", 1]]

    def jwt_log_in
        token = decode_token(request.headers["Authentication"])
        user_id = token["user_id"]
        user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]