app/controllers/api/v1/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "bio", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"