app/controllers/comments_controller.rb

    def index #not sure if needed
        render json: Comment.all
---
SELECT "comments".* FROM "comments"

    def create
        new_comment = Comment.new(comment_params)
        new_comment.save
---
INSERT INTO "comments" ("body", "picture", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        specific_comment.update(comment_params)
---
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "Have fun with your newthis is a comment for a test. friends"], ["updated_at", "2020-07-08 17:59:22.202667"], ["id", 19]]

    def destroy
        render json: specific_comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 9]]

    def specific_comment
        Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]