app/controllers/messages_controller.rb

    def search
        x = Message.find_by(user_id: params[:w], friend_id: params[:z])
        y = Message.find_by(user_id: params[:z], friend_id: params[:w])
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 AND "messages"."friend_id" = $2 LIMIT $3  [["user_id", 10], ["friend_id", 8], ["LIMIT", 1]]

    def show(id=nil)
        if id
            render json: Message.find(id).to_json(include: [{user: {only: [:username, :bio, :avatar]}}, {friend: {only: [:username, :bio, :avatar]}},:remarks])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "remarks".* FROM "remarks" WHERE "remarks"."message_id" = $1  [["message_id", 2]]

    def specific_message
        Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]