app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "friend_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 9], ["friend_id", 10]]
---
    def create
        mesg = Message.create(user_id: params[:first_person], friend_id: params[:second_person])