app/controllers/posts_controller.rb

    def show
        render json: Post.find(params[:id]).to_json(include: [{user: {only: [:username, :bio, :avatar] }}, {comments: {include: {user: {only: [:username, :bio, :avatar] }}}}])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create #WORKS
        new_post = Post.new(post_params)
        new_post.save
---
INSERT INTO "posts" ("body", "picture", "user_id", "subject", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update #WORKS
        specific_post.update(post_params)
---
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "[EDITED]"], ["updated_at", "2020-07-04 02:32:17.334106"], ["id", 4]]

    def destroy #WORKS
        specific_post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]

    def specific_post
        Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]