app/controllers/remarks_controller.rb

    def create
        new_remark = Remark.create(remark_params)
---
INSERT INTO "remarks" ("user_id", "message_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 14], ["message_id", 14], ["body", "hi sam"]]