app/controllers/users_controller.rb

    def create #WORKS
        new_user = User.new(user_params)
        new_user.password = params[:password_digest]
        new_user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "zip", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def my_direct_messages
        user = User.find(params[:id])
        all_mesgs = user.messages + Message.all.select{|m| m.friend == user}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 15]]